
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьАкты(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Период не выбран");
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = СоздатьАктыНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	Оповещение = Новый ОписаниеОповещения("ПриЗавершении", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьАктыНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ЭтотОбъект);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработка.ЗагрузкаДанных.МодульОбъекта.СоздатьАкты",
		Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);

КонецФункции

&НаКлиенте
Процедура ПриЗавершении(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если Результат.Статус = "Выполнено" Тогда
		АдресРезультата = Результат.АдресРезультата;
		Реализации = ПолучитьИзВременногоХранилища(АдресРезультата);
		ЗаполнитьАкты(Реализации);		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАкты(Реализации)
	
	Объект.ДокументыЗаПериод.Очистить();
	
	Для Каждого СписокРеализацияСтруктура Из Реализации Цикл
		
		НоваяСтрока = Объект.ДокументыЗаПериод.Добавить();
		НоваяСтрока.Договор = СписокРеализацияСтруктура.Договор;
		НоваяСтрока.ДокументРеализация = СписокРеализацияСтруктура.Реализация;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
