
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьАкты(Команда)
	
	ДлительнаяОперация = СоздатьАктыНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	Оповещение = Новый ОписаниеОповещения("ПриЗавершении", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьАктыНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ЭтотОбъект);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработка.ЗагрузкаДанных.МодульОбъекта.СоздатьАкты");

КонецФункции

&НаКлиенте
Процедура ПриЗавершении(Результат, ДопПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		АдресРезультата = Результат.АдресРезультата;
		МассивСтруктур = ПолучитьИзВременногоХранилища(АдресРезультата);
		
		Для Каждого Строка Из МассивСтруктур Цикл
			НоваяСтрока = Элементы.НовыеРеализации.ДобавитьСтроку();
			НоваяСтрока.Договор = Строка.Договор;
			НоваяСтрока.РеализацияТоваровИУслуг = Строка.РеализацияТоваровИУслуг;
		КонецЦикла;
			
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
