
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Параметры.Адрес;
	ОтпускаСотрудников.Загрузить(ПолучитьИзВременногоХранилища(Адрес));
	
	Диаграмма.Очистить();
	Диаграмма.Обновление = Ложь;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		
		ТочкаДГ = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		СерияДГ = Диаграмма.УстановитьСерию("Отпуск");
		
		Значение = Диаграмма.ПолучитьЗначение(ТочкаДГ, СерияДГ);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;

КонецПроцедуры

#КонецОбласти

