
#Область ПрограммныйИнтерфейс

Функция СоздатьАкты() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Договор
	|ПОМЕСТИТЬ ВТ_ДоговораСРеализацией
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораСРеализацией КАК ВТ_ДоговораСРеализацией
	|		ПО ВТ_ДоговораСРеализацией.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|	И ДоговорыКонтрагентов.Ссылка <> ВТ_ДоговораСРеализацией.Договор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтрокиТЗ = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТЗ = Новый Структура;
		
		Попытка
			Реализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("Договор", Выборка.Ссылка);
			Реализация.Заполнить(ПараметрыЗаполнения);

			Реализация.ВыполнитьАвтозаполнение();
			
			Если Реализация.ПроверитьЗаполнение() Тогда
				Реализация.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;	
			
			СтрокаТЗ.Вставить("Договор", Выборка.Ссылка);
			СтрокаТЗ.Вставить("РеализацияТоваровИУслуг", Реализация.Ссылка);
			СтрокиТЗ.Добавить(СтрокаТЗ);
			
		Исключение
	
			ЗаписьЖурналаРегистрации("Создание реализаций", УровеньЖурналаРегистрации.Ошибка,,,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()) , );	
				
		КонецПопытки;
				
	КонецЦикла;
	
	Возврат СтрокиТЗ
		
КонецФункции	 

#КонецОбласти
